/*//===================================================================================////
////																			                                             ////
////   Функционал Free Coins, предназначен для подключения в основной f.js документа   ////
////																			                                             ////
////===================================================================================////
//// 			        		 	    	   ////
//// 			    Оглавление  			 ////
//// 			         				       ////
////=============================//*/
/**
 *
 * 	s8. Функционал Free Coins игроков
 *
 * 		Модель ежедневной награды
 * 		-------------------------
 *    f.s8.get_freecoins      	| s8.1. Получить бесплатные монеты
 *    f.s8.fc_block             | s8.2. Заблокировать интерфейс бесплатных монет
 *    f.s8.fc_unblock           | s8.3. Разблокировать интерфейс бесплатных монет
 *    f.s8.fc_left2unblock      | s8.4. Обновить время, оставшееся до следующего дня
 *
 *
 *
 */

	//--------------------------------------------------------------------//


//========================//
// 			        		 	    //
// 			 Функционал  			//
// 			         			    //
//====================----//
var ModelFunctionsFc = { constructor: function(self, f) { f.s8 = this;

	//-----------------------------//
	// 			        		 	         //
	// 	s8. Функционал Free Coins  //
	// 			         			         //
	//-----------------------------//

	//----------------------------------//
	// s8.1. Получить бесплатные монеты //
	//----------------------------------//
	f.s8.get_freecoins = function() {

		// 1] Если пользователь уже получал сегодня награду, завершить
		if(self.m.s8.reword.is_got_reword() == 1) return;

		// 2] Завершить, если (или):
		// - Интерфейс заблокирован.
		// - Это анонимный пользователь.
		if(self.m.s0.ajax_counter() || !layoutmodel.m.s0.is_logged_in()) return;

		// 3] Выполнить ajax-запрос
		ajaxko(self, {
			key: 	    		"D10009:10",
			from: 		    "f.s8.get_freecoins",
			data: 		    {

			},
			ajax_params: {

			},
			prejob:       function(config, data, event){

				// 1] Включить спиннер на кнопке
				self.m.s8.reword.is_spinner_vis(true);

			},
			postjob:      function(data, params){


			},
			ok_0:         function(data, params){

				// n] Выключить спиннер на кнопке
				self.m.s8.reword.is_spinner_vis(false);

			},
			ok_1:         function(data, params){

				// n] Выключить спиннер на кнопке
				self.m.s8.reword.is_spinner_vis(false);

			},
			ok_2:         function(data, params){

				// 1] Если пользователь уже получил награду
				if(data.data.errormsg == "1")
					toastr.error("Сегодня Вы уже получили бесплатные монеты.", "Ошибка");

				// 2] Если запрос от анонимуса
				else if(data.data.errormsg == "2")
					toastr.error("Бесплатные монеты может получить только аутентифицированный пользователь.", "Ошибка");

				// n] Если это обычная ошибка
				else {
					toastr.error(data.data.errormsg, "Ошибка при обработке заказа");
				}

				// n] Выключить спиннер на кнопке
				self.m.s8.reword.is_spinner_vis(false);

			}
		});


	};

	//------------------------------------------------//
	// s8.2. Заблокировать интерфейс бесплатных монет //
	//------------------------------------------------//
	f.s8.fc_block = function() {

		self.m.s8.reword.is_got_reword(1);

	};

	//-------------------------------------------------//
	// s8.3. Разблокировать интерфейс бесплатных монет //
	//-------------------------------------------------//
	f.s8.fc_unblock = function() {

		self.m.s8.reword.is_got_reword(0);

	};

	//----------------------------------------------------//
	// s8.4. Обновить время, оставшееся до следующего дня //
	//----------------------------------------------------//
	f.s8.fc_left2unblock = function(data) {

		self.m.s8.reword.time_until_next_day(data.end);

	};








return this; }};




























