<?php
////======================================================////
////																										  ////
////                    Событие Event	        			      ////
////																											////
////======================================================////

  //-------------------//
  // Пространство имён //
  //-------------------//

    namespace R2;

  //---------------------------------//
  // Подключение необходимых классов //
  //---------------------------------//

    // Базовые классы, необходимые для работы событий вообще
    use App\Events\Event as OriginalEvent,
        Illuminate\Queue\SerializesModels,
        Illuminate\Contracts\Broadcasting\ShouldBroadcast;

  //---------------//
  // Событие Event //
  //---------------//
  class Event extends OriginalEvent
  {

      //---------------------//
      // А. Подключить трейт //
      //---------------------//
      use SerializesModels;

      //-------------------------------------//
      // Б. Переменные для приёма аргументов //
      //-------------------------------------//
      // - При трансляции, public-переменные будут переданы
      public $data;

      //------------------------------------------------------------------//
      // В. Принять аргументы, переданные при создании экземпляра события //
      //------------------------------------------------------------------//
      // - Переданные в аргументе экземпляры модели будут сериализоваться
      public function __construct($data)
      {

        $this->data = $data;

      }

  }