/*//==========================================================================////
////																		                                      ////
////   Модель FAQ, предназначенная для подключения в основной m.js	документа	////
////																				                                  ////
////==========================================================================////
//// 			        		 	    	   ////
//// 			    Оглавление  			 ////
//// 			         				       ////
////=============================//*/
/**
 *
 *
 * 	s5. Модель ТОПа игроков
 *
 * 		s5.1. ...
 *    s5.n. Индексы и вычисляемые значения
 *
 * 	X. Подготовка к завершению
 *
 *    X1. Вернуть ссылку self на объект-модель
 *
 *
 */


//====================//
// 			        		 	//
// 			 Модель  			//
// 			         			//
//====================//
var ModelFaq = { constructor: function(self, m) { m.s5 = this;

	//---------------------------//
	// 			        		 	       //
	// 	s5. Модель ТОПа игроков  //
	// 			         			       //
	//---------------------------//

	//-------------------------------------------------//
	// s5.1. ... //
	//-------------------------------------------------//
	self.m.s5.prop = ko.observable(123);


	//--------------------------------------//
	// s5.n. Индексы и вычисляемые значения //
	//--------------------------------------//
	self.m.s5.indexes = {};

		// s1.n.1. Общие вычисления //
		//--------------------------//
		ko.computed(function(){

			// 1] ...


		}); //.extend({rateLimit: 10, method: "notifyWhenChangesStop"});



	//------------------------------//
	// 			        		 	          //
	// 	X. Подготовка к завершению  //
	// 			         			          //
	//------------------------------//

	//------------------------------------------//
	// X1. Вернуть ссылку self на объект-модель //
	//------------------------------------------//
	return self.m.s5;


}};	// конец модели









