/*//==========================================================================================////
////																		                                                      ////
////   Модель профиля пользователя, предназначенная для подключения в основной m.js	документа	////
////																				                                                  ////
////==========================================================================================////
//// 			        		 	    	   ////
//// 			    Оглавление  			 ////
//// 			         				       ////
////=============================//*/
/**
 *
 *
 * 	s3. Модель профиля пользователя
 *
 * 		s3.1. ...
 *    s3.n. Индексы и вычисляемые значения
 *
 * 	X. Подготовка к завершению
 *
 *    X1. Вернуть ссылку self на объект-модель
 *
 *
 */


//====================//
// 			        		 	//
// 			 Модель  			//
// 			         			//
//====================//
var ModelProfile = { constructor: function(self, m) { m.s3 = this;

	//-----------------------------------//
	// 			        		 	               //
	// 	s3. Модель профиля пользователя  //
	// 			         			               //
	//-----------------------------------//

	//---------------------------------------------------------------------------//
	// s3.1. ... //
	//---------------------------------------------------------------------------//
	self.m.s3.prop = ko.observable(123);



	//--------------------------------------//
	// s3.n. Индексы и вычисляемые значения //
	//--------------------------------------//
	self.m.s3.indexes = {};

		// s1.n.1. ... //
		//------------------------------------------//
		ko.computed(function(){


		}); //.extend({rateLimit: 10, method: "notifyWhenChangesStop"});



	//------------------------------//
	// 			        		 	          //
	// 	X. Подготовка к завершению  //
	// 			         			          //
	//------------------------------//

	//------------------------------------------//
	// X1. Вернуть ссылку self на объект-модель //
	//------------------------------------------//
	return self.m.s3;


}};	// конец модели









