#!/bin/bash
#################
##     app     ##
########################################################################
## Единая точка входа в приложение, без агрументов показывает справку ##
########################################################################
: '
 
  a. Подключить конфиг CLI-приложения
  b. Подключить необходимые в проекте цвета
  c. Подключить алиасы проекта

  1. Если кол-во позиционных аргументов == 0, показать справку
  2. Провести валидацию 1-го аргумента
  3. Сохранить название операции, сдвинуть все аргументы влево на 1
  4. Если $operation == "up"
  5. Если $operation == "down"
  6. Если $operation == "restart"
  7. Если $operation == "update"
 
'
#########################################################################
func_wrapper_app () { 

  # a. Подключить конфиг CLI-приложения
  . cli/config

  # b. Подключить необходимые в проекте цвета
  . cli/colors  
  
  # c. Подключить алиасы проекта
  . cli/aliases

  # 1. Если кол-во позиционных аргументов == 0, показать справку
  if [ $# == 0 ]; then 

    # 1] Выполнить help без опций
    . other/cli/help

    # 2] Завершить
    return

  fi

  # 2. Провести валидацию 1-го аргумента
  # - Если первый аргумент не пуст, но не является допустимым
  if [ $1 != "up" ] && [ $1 != "down" ] && [ $1 != "restart" ] && [ $1 != "update" ]; then 

    # 2.1. Сообщить о недопустимом значении 1-го аргумента
    echo "--- app ---> Недопустимое значение 1-го аргумента. Возможные значения: [up, down, restart, update]"

    # 2.2. Завершить
    return

  fi

  # 3. Сохранить название операции, сдвинуть все аргументы влево на 1
  # - Название находится в 1-м аргументе
  operation=$1
  shift 1

  # 4. Если $operation == "up"
  # - Выполнить скрипт cli/up, и завершить
  if [ $operation == "up" ]; then   
    . cli/up
    return      
  fi  
  
  # 5. Если $operation == "down"
  # - Выполнить скрипт cli/down, и завершить
  if [ $operation == "down" ]; then   
    . cli/down
    return      
  fi  
  
  # 6. Если $operation == "restart"
  # - Выполнить скрипт cli/restart, и завершить
  if [ $operation == "restart" ]; then   
    . cli/restart
    return      
  fi
  
  # 7. Если $operation == "update"
  # - Выполнить скрипт cli/update, и завершить
  if [ $operation == "update" ]; then   
    . cli/update
    return      
  fi      
  
  
:;}
func_wrapper_app "$@"






