<?php

return [

    //---------------------------------------------------------------------------//
    // 1] История обновлений базы данных пакета. Не редактировать вручную.       //
    //    History of updates of database of the package. Don't edit it manually. //
    //---------------------------------------------------------------------------//
    'updateshistory'    => [],

    //-------------------------------------------------------------------------//
    // 2] История обновлений конфига пакета. Не редактировать вручную.         //
    //    History of updates of config of the package. Don't edit it manually. //
    //-------------------------------------------------------------------------//
    'cnfupdshistory'    => [],

    //------------------------------//
    // 3] Имя и описание пакета     //
    //    Locale of package         //
    //------------------------------//
    'aboutpack' => [
      'RU' => [
        'name'        => "Timeserver",
        'description' => "Timeserver package",
      ],
      'EN' => [
        'name'        => "Timeserver",
        'description' => "Timeserver package",
      ]
    ],

    //----------------------------------------------------//
    // 4] UTC-смещение в часах для возвращаемого значения //
    //    UTC-offset in hours for the return value        //
    //----------------------------------------------------//
    'utcoffset' => '3'



];
