<?php

return [

    //---------------------------------------------------------------------------//
    // 1] История обновлений базы данных пакета. Не редактировать вручную.       //
    //    History of updates of database of the package. Don't edit it manually. //
    //---------------------------------------------------------------------------//
    'updateshistory'    => [],

    //-------------------------------------------------------------------------//
    // 2] История обновлений конфига пакета. Не редактировать вручную.         //
    //    History of updates of config of the package. Don't edit it manually. //
    //-------------------------------------------------------------------------//
    'cnfupdshistory'    => [],

    //------------------------------//
    // 3] Имя и описание пакета     //
    //    Locale of package         //
    //------------------------------//
    'aboutpack' => [
      'RU' => [
        'name'        => "Routing",
        'description' => "Routing for the app",
      ],
      'EN' => [
        'name'        => "Routing",
        'description' => "Routing for the app",
      ]
    ],

    //-----------------------------------------------------------------------//
    // 4] Время в минутах, на которое кэшируются связанные с запросами роуты //
    //    Routes cache time in minutes                                       //
    //-----------------------------------------------------------------------//
    'routescachetime'    => 60,


];
