<?php

return [

    //---------------------------------------------------------------------------//
    // 1] История обновлений базы данных пакета. Не редактировать вручную.       //
    //    History of updates of database of the package. Don't edit it manually. //
    //---------------------------------------------------------------------------//
    'updateshistory' => [],

    //-------------------------------------------------------------------------//
    // 2] История обновлений конфига пакета. Не редактировать вручную.         //
    //    History of updates of config of the package. Don't edit it manually. //
    //-------------------------------------------------------------------------//
    'cnfupdshistory' => [],

    //-----------------//
    // 3] Локализация  //
    //    localization //
    //-----------------//

      // 3.1] Поддерживаемые пакетом локали | The locales that are supported by the package //
      //------------------------------------------------------------------------------------//
      'locales' => ['RU', 'EN'],

      // 3.2] Выбранная локаль | Chosen locale //
      //---------------------------------------//
      // - If the value is empty, uses config('app.locale')
      // - Else if config('app.locale') not in 'locales', uses 1-st of 'locales'
      // - Else if 1-st of 'locales' is empty, uses 'RU'.
      'locale' => '',

    //----------------------------------------//
    // 4] Имя и описание пакета               //
    //    Name and description of the package //
    //----------------------------------------//
    'aboutpack' => [
      'RU' => [
        'name'        => "CSGO Lottery game",
        'description' => "CSGO Lottery game",
      ],
      'EN' => [
        'name'        => "CSGO Lottery game",
        'description' => "CSGO Lottery game",
      ]
    ],

    //--------------------------------------------//
    // 5] Параметры по умолчанию для новых комнат //
    //    Default settings for a new game rooms   //
    //--------------------------------------------//
    // - Остальные значения по умолчанию введены в соотв.таблице в БД.

      // 5.1] Разрешить принимать в виде ставок только эти типы вещей | Allow to accept bets by only those types of items
      // - Из:
      //'case',
      //'key',
      //'startrak',
      //'souvenir packages',
      //'souvenir',
      //'knife',
      //'weapon'
      'allow_only_types' => [
        'case',
        'key',
        'startrak',
        'souvenir packages',
        'knife',
        'weapon'
      ],

    //--------------------------------------//
    // 6] Доступные статусы игры "Лоттерея" //
    //    Lottery game statuses             //
    //--------------------------------------//

      'lottery_game_statuses' => [

        "0" => [
          "id"          => "1",
          "status"      => "Created",
          "description" => "Начался новый раунд, но ещё никто не сделал ставку."
        ],

        "1" => [
          "id"          => "2",
          "status"      => "First bet",
          "description" => "Сделана первая и единственная пока ставка за раунд."
        ],

        "2" => [
          "id"          => "3",
          "status"      => "Started",
          "description" => "Сделана вторая ставка за раунд, начался обратный отсчёт таймера."
        ],

        "3" => [
          "id"          => "4",
          "status"      => "Pending",
          "description" => "Время игры закончилось, или достигнут лимит вещей. Ожидание обработки сделанных ранее ставок."
        ],

        "4" => [
          "id"          => "5",
          "status"      => "Lottery",
          "description" => "Визуальное проведение розыгрыша."
        ],

        "5" => [
          "id"          => "6",
          "status"      => "Winner",
          "description" => "Демонстрация победителя розыгрыша и его выигрыша."
        ],

        "6" => [
          "id"          => "7",
          "status"      => "Finished",
          "description" => "Раунд закончен."
        ],

      ],

    //---------------------------//
    // 7] Комнаты игры "Лотерея" //
    //    Lottery game statuses  //
    //---------------------------//
    "rooms" => [

      "Main" => [
        "name"                    => "Комната Main",
        "description"             => "Ставки от 60 р.",
        "description_full"        => "Ставки от 60 р.",
        "is_on"                   => 1,
      ],

    ],

    //-------------------------------//
    // 8] Палитра цветов для игроков //
    //    Color palette for players  //
    //-------------------------------//
    "palette" => [

      "#3e983c",
			"#3e3ca4",
			"#b13d3d",
			"#3c8998",
			"#9bb13d",
			"#a43c8f",
      "#5d3b97",
      "#a3663c",

      "#69973b",
			"#3ca3a2",
			"#753caf",
			"#bc3c3d",
			"#3c987c",
			"#503ca4",
			"#b13d61",
			"#a5bd3d",

			"#3c4698",
			"#a43c7c",
			"#b1a33d",
			"#3dbd6f",
			"#953a8d",
			"#a1783b",
			"#3cad46",
			"#3c6fba",

			"#97543b",
			"#54a33c",
			"#3c91b0",
			"#9e3dbc",
			"#913a72",
			"#3c94b3",
			"#3c61b8",
			"#513cbd",

    ],

    //------------------//
    // 9] Параметры TOR //
    //    TOR settings  //
    //------------------//

      // 9.1] Пароль от TOR | TOR password
      "torpassword" => "mysupertorpassword77714",

      // 9.2] Таймаут в секундах для получения инвентаря | inventory timeout, secs
      "inventory_timeout" => 20,

      // 9.3] Таймаут в секундах подключения/запроса | connection/request timeout,secs
      "connection_request_timeout" => 4,

    //-------------------------------------------------//
    // 10] Вкл/Выкл системы приёма ставок разных типов //
    //    Turn on/off bets systems                     //
    //-------------------------------------------------//

      // 10.1] Включена ли система приёма ставок типа №1
      // - Когда бот отправляет ТП игроку, а последний принимает.
      "is_bets_system_type1_on" => false,

      // 10.2] Включена ли система приёма ставок типа №2
      // - Когда игрок отправляет ТП боту, а последний принимает.
      "is_bets_system_type2_on" => true,

    //-----------------------------------------//
    // 11] Очереди для обработки приёма ставок //
    //    Turn on/off bets systems             //
    //-----------------------------------------//
    "m9_acceptbet_queues" => [
      "m9_acceptbet_1",
      "m9_acceptbet_2",
      "m9_acceptbet_3",
      "m9_acceptbet_4",
      "m9_acceptbet_5",
    ],





];
