/*//=============================================================================================////
////																			                                                       ////
////   Функционал профиля пользователя, предназначен для подключения в основной f.js документа   ////
////																			                                                       ////
////=============================================================================================////
//// 			        		 	    	   ////
//// 			    Оглавление  			 ////
//// 			         				       ////
////=============================//*/
/**
 *
 * 	s3. Функционал профиля пользователя
 *
 *    f.s3.save_steam_tradeurl      | s3.1. Сохранить Steam Trade URL
 *
 *
 */

	//--------------------------------------------------------------------//


//========================//
// 			        		 	    //
// 			 Функционал  			//
// 			         			    //
//====================----//
var ModelFunctionsProfile = { constructor: function(self, f) { f.s3 = this;

	//---------------------------------------//
	// 			        		 	                   //
	// 	s3. Функционал профиля пользователя  //
	// 			         			                   //
	//---------------------------------------//

	//---------------------------------//
	// s3.1. Сохранить Steam Trade URL //
	//---------------------------------//
	f.s3.save_steam_tradeurl = function() {

		// см. f.s2.save_steam_tradeurl

	};



return this; }};




























