/*//==================================================================================////
////																		                                              ////
////   Модель ТОПа игроков, предназначенная для подключения в основной m.js	документа	////
////																				                                          ////
////==================================================================================////
//// 			        		 	    	   ////
//// 			    Оглавление  			 ////
//// 			         				       ////
////=============================//*/
/**
 *
 *
 * 	s4. Модель ТОПа игроков
 *
 * 		s4.1. ...
 *    s4.n. Индексы и вычисляемые значения
 *
 * 	X. Подготовка к завершению
 *
 *    X1. Вернуть ссылку self на объект-модель
 *
 *
 */


//====================//
// 			        		 	//
// 			 Модель  			//
// 			         			//
//====================//
var ModelTop = { constructor: function(self, m) { m.s4 = this;

	//---------------------------//
	// 			        		 	       //
	// 	s4. Модель ТОПа игроков  //
	// 			         			       //
	//---------------------------//

	//---------------------------------------------------------------------------//
	// s4.1. ... //
	//---------------------------------------------------------------------------//
	self.m.s4.prop = ko.observable(123);



	//--------------------------------------//
	// s4.n. Индексы и вычисляемые значения //
	//--------------------------------------//
	self.m.s4.indexes = {};

		// s1.n.1. ... //
		//------------------------------------------//
		ko.computed(function(){


		}); //.extend({rateLimit: 10, method: "notifyWhenChangesStop"});



	//------------------------------//
	// 			        		 	          //
	// 	X. Подготовка к завершению  //
	// 			         			          //
	//------------------------------//

	//------------------------------------------//
	// X1. Вернуть ссылку self на объект-модель //
	//------------------------------------------//
	return self.m.s4;


}};	// конец модели









