/*//======================================================================================////
////																			                                                ////
////   Функционал игры Jackpot, предназначен для подключения в основной f.js	документа   ////
////																			                                                ////
////======================================================================================////
//// 			        		 	    	   ////
//// 			    Оглавление  			 ////
//// 			         				       ////
////=============================//*/
/**
 *
 * 	s1. Функционал игры Jackpot
 *
 *    f.s1.func										| s1.1. Функция
 *
 *
 *
 *
 */


//========================//
// 			        		 	    //
// 			 Функционал  			//
// 			         			    //
//====================----//
var ModelFunctionsJackpot = { constructor: function(selfmain) { var self = {}; self.f = {}; self.f.s1 = this;

	//-------------------------------------//
	// s1.1. Функция //
	//-------------------------------------//
	self.f.s1.func = function(data, event) {
		console.log(123);
	};



return self.f.s1; }};




























