/*//==================================================================================////
////																		                                              ////
////   Модель игры Jackpot, предназначенная для подключения в основной m.js	документа	////
////																				                                          ////
////==================================================================================////
//// 			        		 	    	   ////
//// 			    Оглавление  			 ////
//// 			         				       ////
////=============================//*/
/**
 *
 *
 * 	А. Модель игры Jackpot
 *
 * 		A1.
 * 		A2.
 *    An. Индексы и вычисляемые значения
 *
 * 	X. Подготовка к завершению
 *
 * 		X1. Сервис провайдер клиентской модели
 *    X2. Вернуть ссылку на объект-модель
 *
 *
 */


//====================//
// 			        		 	//
// 			 Модель  			//
// 			         			//
//====================//
var ModelJackpot = { constructor: function() { var m = this;


	//--------------------------//
	// 			        		 	      //
	// 	А. Модель игры Jackpot  //
	// 			         			      //
	//--------------------------//

	//------------------------------------//
	// A1. Свойство //
	//------------------------------------//
	m.name = ko.observable('ivan');


	//------------------------------------//
	// An. Индексы и вычисляемые значения //
	//------------------------------------//
	ko.computed(function(){

		//-------------------------------------//
		// Аn.1. Объект-контейнер для индексов //
		//-------------------------------------//
		m.indexes = {};


	});



	//------------------------------//
	// 			        		 	          //
	// 	X. Подготовка к завершению  //
	// 			         			          //
	//------------------------------//

	//----------------------------------------//
	// X1. Сервис провайдер клиентской модели //
	//----------------------------------------//
	// - Код здесь выполняется лишь 1 раз, при открытии документа в браузере.
	// - Отличное место, скажем, для назначения обработчиков событий.
	ko.computed(function(){

		//-------------------------------------------------------------//
		// X1.1. Выполнять код ниже лишь 1 раз, при загрузке документа //
		//-------------------------------------------------------------//
		if(!ko.computedContext.isInitial()) return;

		//-------------------------------------------------------------//
		// X1.2. ... //
		//-------------------------------------------------------------//

			// ... код ...

	});

	//------------------------------------------//
	// X2. Вернуть ссылку self на объект-модель //
	//------------------------------------------//
	return m;


}};	// конец модели









